Tekla Open API Reference for Tekla Structures 2025
OBB.SetExtent Method (Double[])
 Sets the extents to the OBB.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetExtent(
	double[] extent
)
Public Sub SetExtent (
	extent As Double()
)
Parameters
extent
Type: System.Double[]
Three element array of the OBB extents (half-lengths of the edges).
Exceptions
Exception | Condition
ArgumentException | Thrown when setting the extent fails.
See Also
Reference
OBB Class
SetExtent Overload
Tekla.Structures.Geometry3d Namespace